# .txt to .csv converter
---
## Eduard Larrañaga

Observatorio Astronómico Nacional\
Facultad de Ciencias\
Universidad Nacional de Colombia

---

### About this notebook

In this worksheet, we present a code to read a .txt file using `pandas` and writes a .csv file with the data, inserting the column names.

---

In [3]:
import pandas as pd

In [4]:
read_file = pd.read_table('hubble.txt', delim_whitespace=True, names=('Name','N_measurements','velocity','mean_m'))
read_file.to_csv (r'hubble.csv', index=None)
read_file

         Name  N_measurements  velocity  mean_m
0       Virgo               7       890    12.5
1     Pegasus               5      3810    15.5
2      Pisces               4      4630    15.4
3      Cancer               2      4820    16.0
4     Perseus               4      5230    16.4
5        Coma               3      7500    17.0
6  Ursa_Major               1     11800    18.0
7         Leo               1     19600    19.0
8   [No_Name]              16      2350    13.8
9   [No_Name]              16       630    11.6